In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn'],
                  'FlightNumber':[10045,np.nan,10065,np.nan,10085],
                  'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                  'Airline':['KLM(!)','<Air France> (12)','(British Airways.)','12. Air France','''Swiss Air''']})
print(df)

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [3]:
# 1. Some values in the the FlightNumber column are missing. These numbers are
# meant to increase by 10 with each row so 10055 and 10075 need to be put in
# place. Fill in these missing numbers and make the column an integer column
# (instead of a float column).

In [4]:
np.where(df['FlightNumber'].isnull())

(array([1, 3], dtype=int64),)

In [5]:
df['FlightNumber'].iloc[1] = 10055
df['FlightNumber'].iloc[3] = 10055

C:\Users\admin\anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [6]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN       10055.0            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis       10055.0          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [7]:
df['FlightNumber'].dtype

dtype('float64')

In [8]:
df['FlightNumber'] = df['FlightNumber'].astype('int64')

In [9]:
df['FlightNumber'].dtype

dtype('int64')

In [10]:
print(df)

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []   <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis         10055          [13]      12. Air France
4   Brussels_londOn         10085      [67, 32]           Swiss Air

In [11]:
# 2. The From_To column would be better as two separate columns! Split each
# string on the underscore delimiter _ to give a new temporary DataFrame with
# the correct values. Assign the correct column names to this temporary
# DataFrame.

In [12]:
df_temp = df.copy()

In [13]:
df_temp[['From','To']] = df_temp.From_To.str.split('_',expand=True)

In [14]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways.),londON,StockhOlm
3,Budapest_PaRis,10055,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]",Swiss Air,Brussels,londOn

In [15]:
df_temp.drop(['From_To'],axis='columns')

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    LoNDon      paris
1         10055            []   <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways.)    londON  StockhOlm
3         10055          [13]      12. Air France  Budapest      PaRis
4         10085      [67, 32]           Swiss Air  Brussels     londOn

In [16]:
df_temp = df_temp.reindex(columns=['From','To','FlightNumber','RecentDelays','Airline'])

In [17]:
# The final output is below.
df_temp

       From         To  FlightNumber  RecentDelays             Airline
0    LoNDon      paris         10045      [23, 47]              KLM(!)
1    MAdrid      miLAN         10055            []   <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways.)
3  Budapest      PaRis         10055          [13]      12. Air France
4  Brussels     londOn         10085      [67, 32]           Swiss Air

In [18]:
# Original dataframe is not changed.
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []   <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis         10055          [13]      12. Air France
4   Brussels_londOn         10085      [67, 32]           Swiss Air

In [19]:
# 3. Notice how the capitalisation of the city names is all mixed up in this
# temporary DataFrame. Standardise the strings so that only the first letter is
# uppercase (e.g. "londON" should become "London".)

In [20]:
dim = df_temp.shape
dim = dim[0]
dim

5

In [21]:
# Standardising the strings in From columns.
for i in range(dim):
    name = df_temp['From'].iloc[i]
    df_temp['From'].iloc[i] = name.title()

# Standardising the strings in To columns.
for i in range(dim):
    name = df_temp['To'].iloc[i]
    df_temp['To'].iloc[i] = name.title()

C:\Users\admin\anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [22]:
df_temp

       From         To  FlightNumber  RecentDelays             Airline
0    London      Paris         10045      [23, 47]              KLM(!)
1    Madrid      Milan         10055            []   <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways.)
3  Budapest      Paris         10055          [13]      12. Air France
4  Brussels     London         10085      [67, 32]           Swiss Air

In [23]:
# 4. Delete the From_To column from df and attach the temporary DataFrame
# from the previous questions.

In [24]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []   <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis         10055          [13]      12. Air France
4   Brussels_londOn         10085      [67, 32]           Swiss Air

In [25]:
df = df.drop(['From_To'],axis='columns')

In [26]:
df

   FlightNumber  RecentDelays             Airline
0         10045      [23, 47]              KLM(!)
1         10055            []   <Air France> (12)
2         10065  [24, 43, 87]  (British Airways.)
3         10055          [13]      12. Air France
4         10085      [67, 32]           Swiss Air

In [27]:
df_new_temp = df_temp.iloc[:,0:2]
df_new_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [28]:
df_new = pd.concat([df_new_temp,df],axis='columns')
df_new

       From         To  FlightNumber  RecentDelays             Airline
0    London      Paris         10045      [23, 47]              KLM(!)
1    Madrid      Milan         10055            []   <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways.)
3  Budapest      Paris         10055          [13]      12. Air France
4  Brussels     London         10085      [67, 32]           Swiss Air

In [29]:
# 5. In the RecentDelays column, the values have been entered into the
# DataFrame as a list. We would like each first value in its own column, each
# second value in its own column, and so on. If there isn't an Nth value, the value
# should be NaN.
# Expand the Series of lists into a DataFrame named delays, rename the columns
# delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
# with delays.

In [30]:
delayed = df_new['RecentDelays'].iloc[0]
len(delayed)

2

In [31]:
# To find the max length of list in the dataframe
max = 0
for i in range(dim):
    a = df_new['RecentDelays'].iloc[i]
    b = len(a)
    if b>max:
        max = b

In [32]:
max

3

In [33]:
df_new[['Delay_1','Delay_2','Delay_3']] = pd.DataFrame(df_new.RecentDelays.tolist(), index= df_new.index)

In [34]:
df_new

,From,To,FlightNumber,RecentDelays,Airline,Delay_1,Delay_2,Delay_3
0,London,Paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways.),24.0,43.0,87.0
3,Budapest,Paris,10055,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"[67, 32]",Swiss Air,67.0,32.0,NaN

In [35]:
df_new = df_new.drop(['RecentDelays'],axis=1)
df_new

,From,To,FlightNumber,Airline,Delay_1,Delay_2,Delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways.),24.0,43.0,87.0
3,Budapest,Paris,10055,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,Swiss Air,67.0,32.0,NaN

In [37]:
df_new_delays = df_new.reindex(columns=['From','To','FlightNumber','Delay_1','Delay_2','Delay_3','Airline'])
df_new_delays

,From,To,FlightNumber,Delay_1,Delay_2,Delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways.)
3,Budapest,Paris,10055,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,Swiss Air